Revit 2016 API
RenderingQualitySettings.AreCurtainWallsDaylightPortals Property
 Indicates whether curtain walls daylight portals.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2013
Syntax
C#
public bool AreCurtainWallsDaylightPortals { get; set; }
Visual Basic
Public Property AreCurtainWallsDaylightPortals As Boolean
	Get
	Set
Visual C++
public:
property bool AreCurtainWallsDaylightPortals {
	bool get ();
	void set (bool value);
}
Remarks
 Set this property to true when sunlighting coming through a curtain wall looks splotchy, this can slow down rendering but helps for rooms with few places for sunlight to enter.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: The RenderingQualitySettings does not use custom quality currently. To use custom quality, set RenderingQuality property to RenderingQuality.Custom.
See Also
RenderingQualitySettings Class
Autodesk.Revit.DB Namespace